;[
  { type: "قش ارز", amount: 20914.05458579605 },
  { type: "كسب فول صويا 48%", amount: 609.9932587523849 },
  { type: "أذرة صفراء", amount: 520.5275808020351 },
  { type: "أذرة شامية", amount: 354.90516872866027 },
  { type: "سورجم", amount: 327.60477113414794 },
  { type: "جلوتوفيد ذرة 60%", amount: 325.3297380012719 },
  { type: "جلوتوفيد 16%", amount: 4574.949440642886 },
  { type: "برسيم حجاز مجفف صناعا %17", amount: 3444.667814131114 },
  { type: "جلوتوفيد 20%", amount: 2927.967642011447 },
][
  ({ type: "قش ارز", amount: 20914.05458579605 },
  { type: "كسب فول صويا 48%", amount: 609.9932587523849 },
  { type: "أذرة صفراء", amount: 520.5275808020351 },
  { type: "أذرة شامية", amount: 354.90516872866027 },
  { type: "سورجم", amount: 327.60477113414794 },
  { type: "جلوتوفيد ذرة 60%", amount: 325.3297380012719 },
  { type: "جلوتوفيد 16%", amount: 4574.949440642886 },
  { type: "برسيم حجاز مجفف صناعا %17", amount: 3444.667814131114 },
  { type: "جلوتوفيد 20%", amount: 2927.967642011447 })
][
  ({ type: "قش ارز", amount: "20914.0546" },
  { type: "كسب فول صويا 48%", amount: "609.9933" },
  { type: "أذرة صفراء", amount: "520.5276" },
  { type: "أذرة شامية", amount: "354.9052" },
  { type: "سورجم", amount: "327.6048" },
  { type: "جلوتوفيد ذرة 60%", amount: "325.3297" },
  { type: "جلوتوفيد 16%", amount: "4574.9494" },
  { type: "برسيم حجاز مجفف صناعا %17", amount: "3444.6678" },
  { type: "جلوتوفيد 20%", amount: "2927.9676" })
]
